create table DW_REP_INDEX_VALUE
(
INDEX_ID      CHAR(6)        comment '指标ID  ',   
INDEX_DATE    DATE           comment '指标日期',  
INDEX_VALUE   DECIMAL(18,6)  comment '指标值  ',  
ETL_DATE      CHAR(10)       comment 'ETL_DATE' 
) comment='指标值表'; 

create table DW_REP_INDEX_VALUE_HIS
(
INDEX_ID      CHAR(6)        comment '指标ID  ',   
INDEX_DATE    DATE           comment '指标日期',  
INDEX_VALUE   DECIMAL(18,6)  comment '指标值  ',  
ETL_DATE      CHAR(10)       comment 'ETL_DATE' 
) comment='指标值历史表';

create table DW_DICT_INDEX
(
INDEX_ID      CHAR(6)       comment '指标ID      ',
MODEL_ID      CHAR(2)       comment '模块ID      ',
INDEX_NAME    VARCHAR(64)   comment '指标名称    ',
INDEX_DESC    VARCHAR(2000) comment '指标描述    ',
STATUS        CHAR(1)       comment '指标状态    ',
CREATE_TIME   TIMESTAMP     comment '创建时间    ',
UPDATE_TIME   TIMESTAMP     comment '最后修改时间'
)  comment '指标字典表';

create table DW_DICT_MODEL
(
MODEL_ID           CHAR(6)         comment '模块ID      ',
LEVEL_ONE          CHAR(2)         comment '一级模块ID  ',
MODEL_NAME_ONE     VARCHAR(255)    comment '一级模块名称',
LEVEL_TWO          CHAR(2)         comment '二级模块ID  ',
MODEL_NAME_TWO     VARCHAR(255)    comment '二级模块名称',
LEVEL_THREE        CHAR(2)         comment '三级模块ID  ',
MODEL_NAME_THREE   VARCHAR(255)    comment '三级模块名称',
STATUS             CHAR(1)         comment '模块状态    ',
CREATE_TIME        TIMESTAMP       comment '创建时间    ',
UPDATE_TIME        TIMESTAMP       comment '最后修改时间'
)   comment '模块字典表';

create table DEV_REP_REPAYMENT_NUM_DAY
(
d_date                   date            not null     comment '日期',    
overdue_num              double(24,4)    default null comment '逾期单数', 
overdue_rate             double(24,4)    default null comment '逾期率', 
repayment_rate           double(24,4)    default null comment '还款率', 
overdue_num_7day         double(24,4)    default null comment '7天期限逾期单数', 
overdue_rate_7day        double(24,4)    default null comment '7天期限逾期率', 
overdue_num_14day        double(24,4)    default null comment '14天期限逾期单数', 
overdue_rate_14day       double(24,4)    default null comment '14天期限逾期率', 
overdue_rate_ouser       double(24,4)    default null comment '老用户逾期率', 
repayment_rate_ouser     double(24,4)    default null comment '老用户还款率', 
overdue_rate_nuser       double(24,4)    default null comment '新用户逾期率', 
repayment_rate_nuser     double(24,4)    default null comment '新用户还款率', 
create_time timestamp  comment '插入时间',
update_time timestamp  comment '修改时间'
)comment='每日还款单位数';

create table DEV_REP_REPAYMENT_MONEY_DAY
(
d_date                   date         not null comment '日期',    
mature_money             double(24,4) default null comment '到期金额      ',  
overdue_money            double(24,4) default null comment '逾期金额      ', 
overdue_rate             double(24,4) default null comment '逾期率        ', 
repayment_rate           double(24,4) default null comment '还款率        ', 
overdue_rate_7day        double(24,4) default null comment '7天期限逾期率 ', 
overdue_rate_14day       double(24,4) default null comment '14天期限逾期率', 
overdue_rate_21day       double(24,4) default null comment '21天期限逾期率', 
mature_money_ouser       double(24,4) default null comment '老用户到期金额',   
overdue_money_ouser      double(24,4) default null comment '老用户逾期金额', 
overdue_rate_ouser       double(24,4) default null comment '老用户逾期率  ', 
repayment_rate_ouser     double(24,4) default null comment '老用户还款率  ', 
mature_money_nuser       double(24,4) default null comment '新用户到期金额', 
overdue_money_nuser      double(24,4) default null comment '新用户逾期金额', 
overdue_rate_nuser       double(24,4) default null comment '新用户逾期率  ', 
repayment_rate_nuser     double(24,4) default null comment '新用户还款率  ', 
create_time timestamp  comment '插入时间',
update_time timestamp  comment '修改时间'
)comment='每日还款金额数据';


create table DEV_REP_REPAYMENT_NUM_DAY_HIS
(
d_date                   date            not null     comment '日期',    
overdue_num              double(24,4)    default null comment '逾期单数', 
overdue_rate             double(24,4)    default null comment '逾期率', 
repayment_rate           double(24,4)    default null comment '还款率', 
overdue_num_7day         double(24,4)    default null comment '7天期限逾期单数', 
overdue_rate_7day        double(24,4)    default null comment '7天期限逾期率', 
overdue_num_14day        double(24,4)    default null comment '14天期限逾期单数', 
overdue_rate_14day       double(24,4)    default null comment '14天期限逾期率', 
overdue_rate_ouser       double(24,4)    default null comment '老用户逾期率', 
repayment_rate_ouser     double(24,4)    default null comment '老用户还款率', 
overdue_rate_nuser       double(24,4)    default null comment '新用户逾期率', 
repayment_rate_nuser     double(24,4)    default null comment '新用户还款率', 
create_time timestamp  comment '插入时间',
update_time timestamp  comment '修改时间'
)comment='每日还款单位数据历史表';

create table DEV_REP_REPAYMENT_MONEY_DAY_HIS
(
d_date                   date         not null comment '日期',    
mature_money             double(24,4) default null comment '到期金额      ',  
overdue_money            double(24,4) default null comment '逾期金额      ', 
overdue_rate             double(24,4) default null comment '逾期率        ', 
repayment_rate           double(24,4) default null comment '还款率        ', 
overdue_rate_7day        double(24,4) default null comment '7天期限逾期率 ', 
overdue_rate_14day       double(24,4) default null comment '14天期限逾期率', 
overdue_rate_21day       double(24,4) default null comment '21天期限逾期率', 
mature_money_ouser       double(24,4) default null comment '老用户到期金额',   
overdue_money_ouser      double(24,4) default null comment '老用户逾期金额', 
overdue_rate_ouser       double(24,4) default null comment '老用户逾期率  ', 
repayment_rate_ouser     double(24,4) default null comment '老用户还款率  ', 
mature_money_nuser       double(24,4) default null comment '新用户到期金额', 
overdue_money_nuser      double(24,4) default null comment '新用户逾期金额', 
overdue_rate_nuser       double(24,4) default null comment '新用户逾期率  ', 
repayment_rate_nuser     double(24,4) default null comment '新用户还款率  ', 
create_time timestamp  comment '插入时间',
update_time timestamp  comment '修改时间'
)comment='每日还款金额数据历史表';

测试语句：
insert into DEV_REP_REPAYMENT_MONEY_DAY values
('2017-06-01','2005000000','1005000000','0.32','0.68','0.22','0.27','0.30','1004200000','600000','0.15','0.85','800900000','200090000','0.19','0.81',now(),now()),
('2017-06-02','2005000000','1005000000','0.32','0.68','0.22','0.27','0.30','1004200000','600000','0.15','0.85','800900000','200090000','0.19','0.81',now(),now()),
('2017-06-03','2005100000','1004800000','0.31','0.69','0.22','0.27','0.29','1004200000','600000','0.15','0.85','800800000','200080000','0.18','0.82',now(),now()),
('2017-06-04','2005200000','1004600000','0.30','0.70','0.21','0.26','0.27','1004200000','600000','0.15','0.85','800700000','200070000','0.17','0.83',now(),now()),
('2017-06-05','2005300000','1004200000','0.29','0.71','0.21','0.26','0.28','1004200000','600000','0.15','0.85','800600000','200060000','0.16','0.84',now(),now()),
('2017-06-06','2005300000','1004200000','0.29','0.71','0.21','0.26','0.28','1004200000','600000','0.15','0.85','800600000','200060000','0.16','0.84',now(),now()),
('2017-06-07','2005300000','1004200000','0.29','0.71','0.21','0.26','0.28','1004200000','600000','0.15','0.85','800600000','200060000','0.16','0.84',now(),now()),
('2017-06-08','2005300000','1004200000','0.29','0.71','0.21','0.26','0.28','1004200000','600000','0.15','0.85','800600000','200060000','0.16','0.84',now(),now()),
('2017-06-09','2005300000','1004200000','0.29','0.71','0.21','0.26','0.28','1004200000','600000','0.15','0.85','800600000','200060000','0.16','0.84',now(),now()),
('2017-06-10','2005000000','1005000000','0.32','0.68','0.22','0.27','0.30','1004200000','600000','0.15','0.85','800900000','200090000','0.19','0.81',now(),now()),
('2017-06-11','2005000000','1005000000','0.32','0.68','0.22','0.27','0.30','1004200000','600000','0.15','0.85','800900000','200090000','0.19','0.81',now(),now()),
('2017-06-12','2005100000','1004800000','0.31','0.69','0.22','0.27','0.29','1004200000','600000','0.15','0.85','800800000','200080000','0.18','0.82',now(),now()),
('2017-06-13','2005200000','1004600000','0.30','0.70','0.21','0.26','0.27','1004200000','600000','0.15','0.85','800700000','200070000','0.17','0.83',now(),now()),
('2017-06-14','2005300000','1004200000','0.29','0.71','0.21','0.26','0.28','1004200000','600000','0.15','0.85','800600000','200060000','0.16','0.84',now(),now()),
('2017-06-15','2005300000','1004200000','0.29','0.71','0.21','0.26','0.28','1004200000','600000','0.15','0.85','800600000','200060000','0.16','0.84',now(),now()),
('2017-06-16','2005300000','1004200000','0.29','0.71','0.21','0.26','0.28','1004200000','600000','0.15','0.85','800600000','200060000','0.16','0.84',now(),now()),
('2017-06-17','2005300000','1004200000','0.29','0.71','0.21','0.26','0.28','1004200000','600000','0.15','0.85','800600000','200060000','0.16','0.84',now(),now()),
('2017-06-18','2005300000','1004200000','0.29','0.71','0.21','0.26','0.28','1004200000','600000','0.15','0.85','800600000','200060000','0.16','0.84',now(),now()),
('2017-06-19','2005000000','1005000000','0.32','0.68','0.22','0.27','0.30','1004200000','600000','0.15','0.85','800900000','200090000','0.19','0.81',now(),now()),
('2017-06-20','2005000000','1005000000','0.32','0.68','0.22','0.27','0.30','1004200000','600000','0.15','0.85','800900000','200090000','0.19','0.81',now(),now()),
('2017-06-21','2005100000','1004800000','0.31','0.69','0.22','0.27','0.29','1004200000','600000','0.15','0.85','800800000','200080000','0.18','0.82',now(),now()),
('2017-06-22','2005200000','1004600000','0.30','0.70','0.21','0.26','0.27','1004200000','600000','0.15','0.85','800700000','200070000','0.17','0.83',now(),now()),
('2017-06-23','2005300000','1004200000','0.29','0.71','0.21','0.26','0.28','1004200000','600000','0.15','0.85','800600000','200060000','0.16','0.84',now(),now()),
('2017-06-24','2005300000','1004200000','0.29','0.71','0.21','0.26','0.28','1004200000','600000','0.15','0.85','800600000','200060000','0.16','0.84',now(),now()),
('2017-06-25','2005300000','1004200000','0.29','0.71','0.21','0.26','0.28','1004200000','600000','0.15','0.85','800600000','200060000','0.16','0.84',now(),now()),
('2017-06-26','2005300000','1004200000','0.29','0.71','0.21','0.26','0.28','1004200000','600000','0.15','0.85','800600000','200060000','0.16','0.84',now(),now()),
('2017-06-27','2005300000','1004200000','0.29','0.71','0.21','0.26','0.28','1004200000','600000','0.15','0.85','800600000','200060000','0.16','0.84',now(),now()),
('2017-06-28','2005000000','1005000000','0.32','0.68','0.22','0.27','0.30','1004200000','600000','0.15','0.85','800900000','200090000','0.19','0.81',now(),now()),
('2017-06-29','2005000000','1005000000','0.32','0.68','0.22','0.27','0.30','1004200000','600000','0.15','0.85','800900000','200090000','0.19','0.81',now(),now()),
('2017-06-30','2005100000','1004800000','0.31','0.69','0.22','0.27','0.29','1004200000','600000','0.15','0.85','800800000','200080000','0.18','0.82',now(),now());

insert into DEV_REP_REPAYMENT_NUM_DAY values
('2017-06-01','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-02','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-03','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-04','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-05','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-06','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-07','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-08','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-09','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-10','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-11','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-12','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-13','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-14','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-15','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-16','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-17','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-18','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-19','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-20','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-21','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-22','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-23','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-24','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-25','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-26','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-27','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-28','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-29','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-06-30','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-07-01','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-07-02','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-07-03','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-07-04','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-07-05','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now()),
('2017-07-06','1000','0.3','0.65','400','0.45','200','0.2','0.51','0.61','0.5','0.68',now(),now());
